'''
Пользователь вводит целое положительное число.
Найдите самую большую цифру в числе.
Для решения используйте цикл while и арифметические операции.
'''


while True:
    number = input('Введите число ')
    if len(number) < 2:
        print('Число не должно быть однозначным\n')
    break
print(nuber)

b=10
a=b
print(a)
